; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v1)
             (pred_3 ?v5 ?v8)
             (pred_6 ?v12 ?v8)
             (pred_11 ?v9 ?v12 )
	     (pred_9 ?v12)
             (pred_10 ?v13)
             (pred_12 ?v5)
             (pred_4 ?v8)
             (pred_8 ?v12)
             (pred_7 ?v5)
             (pred_5 ?v12)
             (pred_2 ))



(:action op_2
:parameters (?v7 ?v3 ?v4 ?v11)
:precondition (and (pred_10 ?v7) (pred_10 ?v3) (pred_12 ?v4) (pred_4 ?v11)
          (pred_1 ?v7 ?v3) (pred_3 ?v4 ?v11)
                   (pred_6 ?v3 ?v11) (pred_9 ?v7) 
                   (pred_8 ?v3) (pred_7 ?v4))
:effect (and  (pred_5 ?v3) (not (pred_8 ?v3))))


(:action op_4
:parameters (?v7 ?v6)
:precondition (and (pred_10 ?v7) (pred_10 ?v6)
               (pred_9 ?v7) (pred_1 ?v7 ?v6) (pred_5 ?v6))
:effect (and (pred_9 ?v6) (not (pred_9 ?v7))))

(:action op_5
:parameters (?v7 ?v4)
:precondition (and (pred_10 ?v7) (pred_12 ?v4) 
                  (pred_9 ?v7) (pred_11 ?v4 ?v7) (pred_2 ))
:effect (and (pred_7 ?v4)
   (not (pred_11 ?v4 ?v7)) (not (pred_2 ))))


(:action op_3
:parameters (?v7 ?v10 ?v2)
:precondition (and (pred_10 ?v7) (pred_12 ?v10) (pred_12 ?v2)
                  (pred_9 ?v7) (pred_7 ?v2) (pred_11 ?v10 ?v7))
:effect (and (pred_7 ?v10) (pred_11 ?v2 ?v7)
        (not (pred_7 ?v2)) (not (pred_11 ?v10 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_10 ?v7) (pred_12 ?v4) 
                  (pred_9 ?v7) (pred_7 ?v4))
:effect (and (pred_2 ) (pred_11 ?v4 ?v7) (not (pred_7 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_06 obj_08 obj_07 obj_01 obj_02 obj_10 obj_04 obj_09
    obj_05 obj_11
    obj_13 obj_03
    )

    (:init
       (pred_2)

       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_03)

       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_06 obj_01)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_09 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_09)
       (pred_6  obj_10 obj_05)
       (pred_6  obj_09 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_04)

       (pred_3  obj_13 obj_05)
       (pred_3  obj_03 obj_11)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_03 obj_08)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_11 obj_13 obj_02)
       (pred_11 obj_03 obj_07)
    ))
(:constraints
  (always (not (pred_9 obj_01)))
)
)

; plan
1. (op_4 obj_07 obj_12)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_12)
   goals met: 0 of 2
2. (op_4 obj_12 obj_06)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_06)
   goals met: 0 of 2
3. (op_5 obj_06 obj_13)
   deleted: (pred_11 obj_13 obj_06) (pred_2)
   added: (pred_7 obj_13)
   goals met: 0 of 2
4. (op_4 obj_06 obj_08)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_08)
   goals met: 0 of 2
5. (op_4 obj_08 obj_02)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_02)
   goals met: 0 of 2
6. (op_1 obj_02 obj_13)
   deleted: (pred_7 obj_13)
   added: (pred_2) (pred_11 obj_13 obj_02)
   goals met: 1 of 2
7. (op_4 obj_02 obj_08)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_08)
   goals met: 1 of 2
8. (op_5 obj_08 obj_03)
   deleted: (pred_11 obj_03 obj_08) (pred_2)
   added: (pred_7 obj_03)
   goals met: 1 of 2
9. (op_4 obj_08 obj_06)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_06)
   goals met: 1 of 2
10. (op_4 obj_06 obj_12)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_12)
   goals met: 1 of 2
11. (op_4 obj_12 obj_07)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_07)
   goals met: 1 of 2
12. (op_1 obj_07 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_2) (pred_11 obj_03 obj_07)
   goals met: 2 of 2
